app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    @semester=Semester.where(:is_open=>true)
    if @semester==nil||@semester.count>1
      redirect_to courses_path, flash: {success: "暂时不能创建课程课"}
    else
      @course.semester_id=@semester.first.id
    end
    if @course.save
---
INSERT INTO "courses" ("name", "course_type", "teaching_type", "exam_type", "credit", "limit_num", "class_room", "course_time", "course_week", "semester_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def destroy
    @course=Course.find_by_id(params[:id])
    current_user.teaching_courses.delete(@course)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 35]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 35]]

  def open
    @course = Course.find_by_id(params[:id])
    if @course.update_attributes(:open=>true)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 45]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2016-12-22 07:38:52.029933"], ["id", 45]]

  def selected
    @course = Course.find_by_id(params[:id])
    @grades=@course.grades.where(:open=>false)
    student = []
    @grades.each do |grade|
      if grade.open = true
        student<<User.find_by_id(grade.user_id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 298486374], ["open", "f"]]
SELECT "users".* FROM "users" INNER JOIN "grades" ON "users"."id" = "grades"."user_id" WHERE "grades"."course_id" = $1  [["course_id", 2]]

  def chart
    @course = Course.find_by_id(params[:id])
    @grades=@course.grades.where(:open=>false)
    student = []
    @grades.each do |grade|
      if grade.open = true
        student<<User.find_by_id(grade.user_id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1 AND "grades"."open" = $2  [["course_id", 298486374], ["open", "f"]]
SELECT "users".* FROM "users" INNER JOIN "grades" ON "users"."id" = "grades"."user_id" WHERE "grades"."course_id" = $1  [["course_id", 2]]

  def list
    @course=Course.all
    @q = Course.ransack(params[:q])
    @course = @q.result.includes(:teacher)
    @course = @q.result(distinct: true)
    @course=@course.where(:open=>true)
    @course=@course-current_user.courses
    @current_user_course=current_user.courses
    @course_time_table = get_current_curriculum_table(@current_user_course, current_user)
    @course_time = get_course_info(@course, 'course_time')
    @course_exam_type = get_course_info(@course, 'exam_type')
    @course_credit = get_course_info(@course, 'credit')
    @course_type = get_course_info(@course, 'course_type')
    @teaching_type = get_course_info(@course, 'teaching_type')
    if request.post?
      res = []
      @course.each do |course|
---
SELECT "courses".* FROM "courses" WHERE "courses"."open" = $1  [["open", "t"]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def select
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 298486374]]